1s/ERP/Conf/Catalogs/Лико_ТипоразмерыСкладскихСекций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ТипоразмерыСкладскихСекций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченаПоГрузоподъемности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченаПоРазмерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ТипоразмерыСкладскихСекций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ШтрихКод(ТипоРазмерСсылка) Экспорт 
	
	Перем ШК;
	
	ВидИнформации = "02";
	
	КодСправочника = Формат(ТипоРазмерСсылка.Код, "ЧЦ=10; ЧВН=; ЧГ=");	
	ШК = "8" + ВидИнформации + КодСправочника;


	КонтольныйСимвол = 0;
	Для Ц = 1 по СтрДлина(ШК) Цикл
		Попытка
			КонтольныйСимвол = КонтольныйСимвол + Число(Сред(ШК, Ц, 1));
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	КонтольныйСимвол = Прав(СокрЛП(КонтольныйСимвол),1);
	
	ШК = ШК + КонтольныйСимвол;
	
	Возврат ШК;

	
	
КонецФункции

Функция ШтрихКодСтрокой(ТипоРазмерСсылка) Экспорт
	
	Перем ШК;
	ВидИнформации = 2;
	
	
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	
	ФКод = Формат(ТипоРазмерСсылка.Код, "ЧЦ=10; ЧН=0000000000; ЧВН=; ЧГ=0"); // 7 символов код объекта номенклатуры
	
	Разделитель = " ";
	
	ШК = "8"+ ФВидИнформации
	+ ФКод;
	
	ШКСтрокой = "6"+ ФВидИнформации + Разделитель
	+ ФКод;
	
	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШК = ШК + КонтольныйСимвол;
	ШКСтрокой = ШКСтрокой + Разделитель + КонтольныйСимвол;
	
	Возврат ШК;
КонецФункции //ПолучитьКороткийШтрихКод Экспорт

 Функция НайтиСоздатьТипоразмер(Высота,Ширина,Глубина,Вес)Экспорт 

	УстановитьПривилегированныйРежим(Истина); 
	
	ЕдиницаИзмеренияВеса 	= Константы.ЕдиницаИзмеренияВеса.Получить();
	ЕдиницаИзмеренияОбъема 	= Константы.ЕдиницаИзмеренияОбъема.Получить();
	ЕдиницаИзмеренияДлины 	= Справочники.Лико_ПредопределенныеЗначения.ЕИМиллиметр.ЗначениеПараметра;
	
	
	
	
	
	ВысотаЕдиницаИзмерения	 = ЕдиницаИзмеренияДлины;
	ГлубинаЕдиницаИзмерения	 = ЕдиницаИзмеренияДлины;
	ШиринаЕдиницаИзмерения	 = ЕдиницаИзмеренияДлины;
	ВесЕдиницаИзмерения		 = ЕдиницаИзмеренияВеса;
	ОбъемЕдиницаИзмерения	 = ЕдиницаИзмеренияОбъема;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ТипоразмерыСкладскихСекций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ТипоразмерыСкладскихСекций КАК Лико_ТипоразмерыСкладскихСекций
	|ГДЕ
	|	Лико_ТипоразмерыСкладскихСекций.Высота = &Высота
	|	И Лико_ТипоразмерыСкладскихСекций.Глубина = &Глубина
	|	И Лико_ТипоразмерыСкладскихСекций.Ширина = &Ширина
	|	И Лико_ТипоразмерыСкладскихСекций.Вес = &Вес
	|	И Лико_ТипоразмерыСкладскихСекций.ВысотаЕдиницаИзмерения = &ВысотаЕдиницаИзмерения
	|	И Лико_ТипоразмерыСкладскихСекций.ГлубинаЕдиницаИзмерения = &ГлубинаЕдиницаИзмерения
	|	И Лико_ТипоразмерыСкладскихСекций.ВесЕдиницаИзмерения = &ВесЕдиницаИзмерения
	|	И Лико_ТипоразмерыСкладскихСекций.ШиринаЕдиницаИзмерения = &ШиринаЕдиницаИзмерения";
	Запрос.УстановитьПараметр("Высота",Высота );
	Запрос.УстановитьПараметр("Ширина",Ширина );
	Запрос.УстановитьПараметр("Глубина",Глубина );
	Запрос.УстановитьПараметр("Вес",Вес );
	Запрос.УстановитьПараметр("ВысотаЕдиницаИзмерения",ВысотаЕдиницаИзмерения ); 
	Запрос.УстановитьПараметр("ГлубинаЕдиницаИзмерения",ГлубинаЕдиницаИзмерения );
	Запрос.УстановитьПараметр("ШиринаЕдиницаИзмерения",ШиринаЕдиницаИзмерения );
	Запрос.УстановитьПараметр("ВесЕдиницаИзмерения",ВесЕдиницаИзмерения );

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	    Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
	НовыйСправочник = СоздатьЭлемент();
	НовыйСправочник.Заполнить(Истина);
	НовыйСправочник.Высота = Высота;
	НовыйСправочник.Ширина = Ширина;
	НовыйСправочник.Глубина = Глубина;
	НовыйСправочник.Вес = Вес;
	
	Попытка
		НовыйСправочник.Записать();
	Исключение
		ОшибкаСообщение = "Ошибка при сохранении справочника Лико_ТипоразмерыСкладскихСекций: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
	КонецПопытки;

	
		
	Возврат НовыйСправочник.Ссылка;
	

	
	
	
	
КонецФункции  


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
